package com.yonyoucloud.fi.cmp.intelligentdealdetail.ods.consts;
/**
 * @Author guoyangy
 * @Date 2024/6/28 9:14
 * @Description 业务异常码值
 * @Version 1.0
 */
public enum DealDetailBusinessCodeEnum {
    //交易回单
    SYSTEM001_01YO1("01y01","按条件未查询到可匹配银行交易回单"),
    SYSTEM001_01SO1("01s01","查询辨识匹配规则异常"),
    SYSTEM002_02YO1("02y01","按条件未查询到银行流水"),
    //查询到的银行流水不满足退票匹配条件
    SYSTEM002_02YO2("02y02","不满足退票标识规则,对方银行账号不同"),
    SYSTEM002_02YO3("02y03","不满足退票标识规则,对方户名不同"),
    SYSTEM002_02YO4("02y04","不满足退票标识规则,对方类型不同"),
    SYSTEM002_02YO5("02y05","不满足退票标识规则,摘要不同"),
    SYSTEM002_02YO6("02y06","匹配条件不满足，银行账户,币种,借贷方向,金额可能不同"),
    SYSTEM002_02YO7("02y07","未查询到可用的银行退票辨识匹配规则"),
    SYSTEM002_02S01("02s01","查询辨识匹配规则异常"),
    SYSTEM002_02S02("02s02","更新退票状态异常"),
    //本方信息匹配
    SYSTEM003_03Y01("03y01","流水已被确认，不再执行本方信息辨识逻辑"),
    SYSTEM003_03Y02("03y02","筛掉已确认流水异常"),
    SYSTEM003_03Y03("03y03","流水的银行账户查询到多条账户使用组织，需要人工确认账户使用组织"),
    SYSTEM003_03S01("03s01","查询企业银行账户档案异常"),
    SYSTEM003_03S02("03s02","流水匹配银行账户异常"),

    //对方信息匹配
    SYSTEM004_04Y01("04y01","账户使用组织未确认"),

    //收付单据匹配
    SYSTEM005_05Y11("05y11","已关联"),
    SYSTEM005_05Y12("05y12","收付单据匹配规则未配置"),
    SYSTEM005_05Y13("05y13","需要在[流水处理规则]节点启用或预置system0103规则"),
    SYSTEM005_05Y14("05y14","根据目标对象未查找到数据源配置，请在【流水处理使用数据源设置】节点启用配置"),
    SYSTEM005_05Y15("05y15","流水处理数据源使用配置节点未配置注册池数据源id"),
    SYSTEM005_05Y16("05y16","财资公共未查询到逻辑池"),
    SYSTEM005_05Y17("05y17","财资公共未注册逻辑池"),
    SYSTEM005_05Y21("05y21","流水未匹配到收付单据匹配规则"),
    SYSTEM005_05Y31("05y31","构建取数参数异常"),
    SYSTEM005_05Y33("05y33","流水未关联到下游单据"),
    SYSTEM005_05Y34("05y34","取数后处理关联逻辑获取分布式锁失败"),
    SYSTEM005_05Y35("05y35","取数后同批次去重"),
    SYSTEM005_05Y36("05y36","取数后目标单据数据库去重"),
    SYSTEM005_05Y37("05y37","关联成功"),
    SYSTEM005_05Y41("05y41","生成关联参数CorrDataEntity异常"),
    SYSTEM005_05SO1("05s01","调取数逻辑系统异常"),

    //查询到的银行流水不满足生单辨识
    SYSTEM007_07YO1("07y01","未查询到可用的生单类型辨识匹配规则"),
    SYSTEM007_07YO2("07y02","生单类型辨识规则中,配置的相关性规则未匹配成功"),
    SYSTEM007_07YO3("07y03","生单类型辨识规则中,配置的相关性规则查询为空"),
    SYSTEM007_07YO4("07y04","当前单据不满足生单类型辨识条件- 提前入账为是"),
    SYSTEM007_07YO5("07y05","当前单据不满足生单类型辨识条件- 关联状态为已关联"),
    SYSTEM007_07YO6("07y06","当前单据不满足生单类型辨识条件- 发布状态为已发布"),
    SYSTEM007_07YO7("07y07","当前单据不满足生单类型辨识条件- 日记账勾对状态为已勾对"),
    SYSTEM007_07YO8("07y08","当前单据不满足生单类型辨识条件- 总账勾对状态为已勾对"),
    SYSTEM007_07S01("07s01","生单类型辨识中相关性规则执行异常"),
    SYSTEM007_07S02("07s02","生单类型辨识规则设置查询异常"),
    SYSTEM007_07S03("07s03","生单类型辨识规则生单，执行生单逻辑异常"),
    //查询到的银行流水不满足发布辨识
    SYSTEM008_08YO1("08y01","未查询到可用的发布辨识匹配规则"),
    SYSTEM008_08YO2("08y02","发布对象辨识规则中,配置的相关性规则未匹配成功"),
    SYSTEM008_08YO3("08y03","发布对象辨识规则中,配置的相关性规则查询为空"),
    SYSTEM008_08YO4("08y04","该流水授权使用组织为空不能进行发布"),
    SYSTEM008_08SO1("08s01","发布对象辨识中相关性规则执行异常"),
    SYSTEM008_08S02("08s02","发布对象辨识规则设置查询异常"),
    //查询到的银行流水不满足挂账辨识
    SYSTEM009_09YO1("09y01","未查询到可用的挂账辨识匹配规则"),
    SYSTEM009_09YO2("09y02","挂账辨识规则中,配置的相关性规则未匹配成功"),
    SYSTEM009_09YO3("09y03","挂账辨识规则中,配置的相关性规则查询为空"),
    SYSTEM009_09S01("09s01","挂账辨识中相关性规则执行异常"),
    SYSTEM009_09S02("09s02","挂账辨识规则设置查询异常"),
    SYSTEM009_09S03("09s03","挂账辨识规则生单，执行生单逻辑异常"),
    //查询到的银行流水不满足其他辨识
    SYSTEM010_10YO1("10y01","未查询到可用的其他信息辨识匹配规则"),
    SYSTEM010_10YO2("10y02","其他信息辨识规则中,配置的相关性规则未匹配成功"),
    SYSTEM010_10YO3("10y03","其他信息辨识规则中,配置的相关性规则查询为空"),
    SYSTEM010_10S01("10s01","其他信息辨识中相关性规则执行异常"),
    SYSTEM010_10S02("10s02","其他信息辨识规则设置查询异常"),
    ;
    private String code;
    private String desc;
    DealDetailBusinessCodeEnum(String code,String desc){
        this.code=code;
        this.desc=desc;
    }
    public String getCode() {
        return code;
    }
    public String getDesc() {
        return desc;
    }
}